[
  {
    "type": "paragraph",
    "data": {
      "command": "brd",
      "brdCrumbs": [
        [
          "Blog",
          "/blogs"
        ],
        [
          "NoteRoom",
          "/blogs/how-to-focus-on-your-study"
        ]
      ]
    }
  },
  {
    "type": "header",
    "data": "How to focus on your Study"
  },
  {
    "type": "paragraph",
    "data": {
      "command": "tag",
      "tags": [
        "#study",
        "#focus",
        "#time"
      ]
    }
  },
  {
    "type": "paragraph",
    "data": {
      "command": "by",
      "text": "Devajit Mutsuddy"
    }
  },
  {
    "type": "paragraph",
    "data": {
      "command": "pfp",
      "text": "rohit.jpg"
    }
  },
  {
    "type": "paragraph",
    "data": {
      "command": "rdtime",
      "text": "5 mins"
    }
  },
  {
    "type": "paragraph",
    "data": {
      "text": "On This Page",
      "command": "idx",
      "items": [
        {
          "index": "Overview",
          "title": "Overview",
          "contents": [
            "Does it ever happen that you sat down for studying and suddenly you were in a scene where you had to save your crush from some bad boys and you were fighting them in your mind? Matthew A. Killingsworth and Daniel T. Gilbert from Harvard University conducted a research titled “A Wandering Mind Is an Unhappy Mind\" which was published in the journal Science in 2010.",
            "The researchers used an app to track the thoughts and feelings of 2250 adults across various daily activities. Participants received notifications at times asking what they were doing, whether they were thinking about something else, and how happy they felt at that moment. Results showed that people’s mind wandered 46.9% of time out of the activity that they were engaged in.&nbsp;",
            "That means, if you study for 2 hours, your mind would wander for 56.28 minutes. Does that mean you have to study more? Haha, not really.&nbsp;",
            "Although, that was a rough estimation, but it’s indeed concerning how human minds wander out of the activity that it was supposed to do.&nbsp;",
            "When it comes to focusing better and getting the most out of our time, we usually keep our phones away from the place, turn off the notifications or try some digital detox apps which show them their screentime. But they also fail after a few trial because hardly any software was developed to instantly turn off your phone for 2 hours after it realized that you were distracted.&nbsp;",
            "So how do you focus in an age of digital distraction, how can you actually get the most out of the hours you sit down to study?&nbsp;"
          ]
        },
        {
          "index": "A Deep Dive into Focus and What Influences it",
          "title": "A Deep Dive into Focus and What Influences it",
          "contents": [
            "<b>Environment</b>&nbsp;",
            "The environment that is mentioned here, is not the environment where you’ll study in, but instead the environment where you are rest of the time.&nbsp;",
            "Just like a trainee having to maintain his body even out of the ring, you also need to maintain a level of depth outside of your study space.",
            "If you are returning home from an event that included loud music and noise all around, you are unlikely to be able to focus for the next couple of hours.&nbsp;",
            "That means if you have been scrolling through social media for hours and suddenly decide to sit down and study, even after turning off all your notifications and keeping your phone 10 miles away, you would not be able to focus on your study.&nbsp;",
            "But if you were engaged in a cognitive platform such as NoteRoom, where contents that are relevant to you and fosters your natural curiosity are organized in a cognitive way, you could focus better on your next study session.&nbsp;",
            "Studies have shown that we are more prone to focus if we have dedicated places for each activity. That means not studying in your bed, not eating in your study space. And also having a distraction free room does the best where you can focus around your thoughts and push your cognitive ability to its limits.&nbsp;",
            "NoteRoom’s Study space can be an option to consider here. You can find the resources in an organized way and can get the best out of your hours. There are functions such as timers, bookmarks, decks to organize your digital study space in the most efficient way.&nbsp;",
            "<b>Purpose &amp; Direction</b>",
            "Ibn Qaiuum said “If you knew the true value of yourself, you’d never allow yourself to be humiliated by committing sins.” It can be taken that if you knew why you are you studying, and you know what do you want to get out of this particular study session that you are sitting down for, you’d never allow yourself to be distracted.&nbsp;",
            "If your mind is aware of the reason that you are sitting down for, you’d be naturally more focused. And if you have been in a stage where you are constantly finding yourself mind wandering, don’t be afraid.&nbsp;",
            "You can’t magically be focused. When you witness your mind that it is distracted, redirect your thoughts towards the reason that you have in your mind. And after you’ve continued the same behavior everytime you find yourself mind wandering, you’ll automatically be more focused towards your goals.&nbsp;",
            "When it comes to success, most people think that you have take big steps towards it, but it actually starts very small. To be able to focus better you can take tiny steps starting from today. It might just be as small as studying for an hour only with the purpose compelling in your mind. And whenever you are distracted, redirect your focus towards the actual task at hand.&nbsp;",
            "<b>Time</b>",
            "If we could work for 4 hours and get an output of 4 hours, we would already be living in an Utopia. So, any time you find yourself putting on several hours to study something, take a pause and think ways to utilize those hours and ways to do it better and quick.&nbsp;",
            "Studies have shown that deadlines are a compelling thing when it comes to getting a task done. If you know that you would take a pause after studying for 1 hour, your brain is much likely to process information better and strengthen neural pathways in a faster way.&nbsp;",
            "The Pomodoro Technique was developed in the late 1980s by Francesco Cirillo, an Italian entrepreneur and productivity expert. It is a time management method that boosts focus and productivity by breaking work into 25-minute intervals (Pomodoros), followed by a 5-minute break. After completing four Pomodoros, take a longer 15–30 minute break. This technique helps reduce procrastination, maintain concentration, and prevent burnout.He named it after the tomato-shaped kitchen timer (pomodoro means \"tomato\" in Italian) that he used while studying.",
            "This is a great practice to keep your brain focused on the tasks while it processes informations in a faster way comparatively.&nbsp;",
            "NoteRoom’s Study Space has an in-built timer in it where you can set time limits of your choice, you can also toggle around the general and the pomodoro mode. Along with organizing your study space, the timer helps you to finish tasks in a faster and efficient way.&nbsp;",
            "<b>Techniques</b>",
            "There are study techniques used all over the world, by the students of the Top Universities that help them to crack any upcoming exam or to study better. Here are some of best ones among them.&nbsp;",
            "<u>Active Recall</u> :&nbsp;Students typically learn by memorizing information. But with active recall, you learn by actively trying to remember the information. Put simply, it’s the process of searching your brain to find an answer. Learn more",
            "<u>Spaced Repetition</u> : Spaced repetition is a learning technique that involves reviewing material at increasing intervals to improve long-term retention, rather than cramming, by reinforcing memory at the point of forgetting. Learn more. ",
            "<u>Pomodoro Technique</u> : Use focused 25-minute study sessions followed by short breaks. This helps sustain concentration and prevents mental fatigue. Learn more.",
            "<u> Feynman Technique </u>: Teach the concept to someone else or explain it in simple terms. This forces you to break down and deeply understand the material. Learn more. ",
            "<u>Mind Mapping</u> : Create visual diagrams to connect and organize information. This helps clarify relationships between concepts and aids in better understanding. Learn more",
            "Remember that running away from a problem (eg. turning off notifications, deactivating/deleting social handles) doesn’t solve the problem. It’s always about a better approach and a lifestyle towards it. Which is our mission at <b><i>NoteRoom</i></b>"
          ]
        }
      ]
    }
  },
  {
    "type": "paragraph",
    "data": {
      "command": "date",
      "text": "2025-10-21T00:13:06.755Z"
    }
  },
  {
    "type": "paragraph",
    "data": {
      "command": "thm",
      "text": "1761005587130.png"
    }
  }
]